## esg_se_xdr_demo_prod plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.oauth_client.module.oauth_client.tfe_oauth_client.this will be created
+   resource "tfe_oauth_client" "this" {
+       api_url          = "https://api.github.com"
+       http_url         = "https://github.com"
+       id               = (known after apply)
+       name             = (known after apply)
+       oauth_token      = (sensitive value)
+       oauth_token_id   = (known after apply)
+       organization     = (known after apply)
+       service_provider = "github"
    }

  # module.organization.module.organization.tfe_organization.this[0] will be created
+   resource "tfe_organization" "this" {
+       collaborator_auth_policy                                = "password"
+       cost_estimation_enabled                                 = true
+       email                                                   = "publiccloud@sophos.com"
+       id                                                      = (known after apply)
+       name                                                    = "esg_se_xdr_demo_prod_67-merge"
+       send_passing_statuses_for_untriggered_speculative_plans = false
+       session_remember_minutes                                = 20160
+       session_timeout_minutes                                 = 20160
    }

  # module.workspace.module.workspace.tfe_workspace.this will be created
+   resource "tfe_workspace" "this" {
+       allow_destroy_plan            = false
+       auto_apply                    = false
+       description                   = ""
+       execution_mode                = "remote"
+       file_triggers_enabled         = true
+       global_remote_state           = false
+       id                            = (known after apply)
+       name                          = "workspace_test_67-merge"
+       operations                    = (known after apply)
+       organization                  = (known after apply)
+       queue_all_runs                = false
+       remote_state_consumer_ids     = (known after apply)
+       speculative_enabled           = true
+       ssh_key_id                    = (sensitive)
+       structured_run_output_enabled = true
+       tag_names                     = (known after apply)
+       terraform_version             = "1.2.0"
+       trigger_prefixes              = [
+           "",
        ]
+       working_directory             = "./environment/esg_se_xdr_demo_prod"

+       vcs_repo {
+           branch             = "67-merge"
+           identifier         = "Dev0psPleb/terraform-cloud-organization"
+           ingress_submodules = false
+           oauth_token_id     = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```